coursework-api/app/controllers/api/v1/courseloads_controller.rb

SELECT "courseloads".* FROM "courseloads"
---
    def index
        courseloads = Courseload.all

INSERT INTO "courseloads" ("language", "general", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["language", "undefined"], ["general", "undefined"], ["link", "undefined"], ["created_at", "2019-11-09 00:08:14.073283"], ["updated_at", "2019-11-09 00:08:14.073283"]]
---
    def create
        @courseload = Courseload.create(courseload_params)